In [14]:
import numpy as np
import pandas as pd
import sqlite3

In [10]:
# load orders.csv
orders = pd.read_csv("orders.csv")
orders_df = pd.DataFrame(orders)
orders_df

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian
...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant

In [12]:
# load users.json
users = pd.read_json("users.json")
users_df = pd.DataFrame(users)
users_df

      user_id       name       city membership
0           1     User_1    Chennai    Regular
1           2     User_2       Pune       Gold
2           3     User_3  Bangalore       Gold
3           4     User_4  Bangalore    Regular
4           5     User_5       Pune       Gold
...       ...        ...        ...        ...
2995     2996  User_2996  Hyderabad       Gold
2996     2997  User_2997  Hyderabad    Regular
2997     2998  User_2998  Bangalore    Regular
2998     2999  User_2999       Pune    Regular
2999     3000  User_3000  Hyderabad       Gold

[3000 rows x 4 columns]

In [15]:
# load restaurants.sql
def sql_to_df(file_path, table_name):
    conn = sqlite3.connect(":memory:") # temp. DB in memory

    with open(file_path, encoding='utf-8') as f:
        conn.executescript(f.read())

    return pd.read_sql(f'SELECT * FROM {table_name};', conn)

In [18]:
restaurants_df = sql_to_df("restaurants.sql", 'restaurants')
restaurants_df

     restaurant_id restaurant_name  cuisine  rating
0                1    Restaurant_1  Chinese     4.8
1                2    Restaurant_2   Indian     4.1
2                3    Restaurant_3  Mexican     4.3
3                4    Restaurant_4  Chinese     4.1
4                5    Restaurant_5  Chinese     4.8
..             ...             ...      ...     ...
495            496  Restaurant_496   Indian     3.1
496            497  Restaurant_497  Mexican     4.4
497            498  Restaurant_498  Chinese     3.9
498            499  Restaurant_499  Mexican     4.9
499            500  Restaurant_500  Chinese     3.2

[500 rows x 4 columns]

In [20]:
# merge_1 = orders_df + users_df
merge_1 = pd.merge(orders_df, users_df, on='user_id', how='left')
merge_1

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular
...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular

In [88]:
# final_food_delivery_dataset = merge_1 + restaurants_df
merge_2 = pd.merge(merge_1, restaurants_df, on='restaurant_id', how='left')
merge_2

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Restaurant_267,Chinese,4.2
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Restaurant_439,Mexican,3.1

In [92]:
# deleting restaurant_name_y column which is of no use
final = merge_2.drop('restaurant_name_y', axis=1)
final

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Italian,3.0
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Italian,4.7
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Chinese,4.2
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Italian,4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Mexican,3.1

In [93]:
# renaming restaurant_name_x --> restaurant_name
final_food_delivery_dataset = final.rename({'restaurant_name_x':'restaurant_name'}, axis=1)
final_food_delivery_dataset

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Italian,3.0
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Italian,4.7
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Chinese,4.2
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Italian,4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Mexican,3.1

In [94]:
# save the final dataset
final_food_delivery_dataset.to_csv('final_food_delivery_dataset.csv', index=False)

#### Which city has the highest total revenue (total_amount) from Gold members?

In [95]:
df_1 = final_food_delivery_dataset.query('membership == "Gold"')[['city', 'total_amount']]
df_1

           city  total_amount
2       Chennai        163.93
3     Bangalore       1155.97
8       Chennai        953.30
11         Pune       1484.65
13      Chennai        898.24
...         ...           ...
9993  Hyderabad        322.54
9994  Bangalore        137.96
9995  Hyderabad       1211.96
9997  Bangalore        979.44
9998  Bangalore       1105.93

[4987 rows x 2 columns]

In [96]:
df_1.nlargest(1, 'total_amount')

      city  total_amount
7985  Pune       1499.83

#### Which cuisine has the highest average order value across all orders?

In [97]:
df_2 = final_food_delivery_dataset.groupby('cuisine')['total_amount'].mean().round(2).sort_values(ascending=False)
df_2

cuisine
Mexican    808.02
Italian    799.45
Indian     798.47
Chinese    798.39
Name: total_amount, dtype: float64

#### How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

In [98]:
df_3 = final_food_delivery_dataset.groupby('user_id')['total_amount'].sum().reset_index()
df_3

      user_id  total_amount
0           1       1289.66
1           2       7564.12
2           3       1839.51
3           4       3741.16
4           5       5742.88
...       ...           ...
2878     2996       1533.54
2879     2997       5310.32
2880     2998       4241.47
2881     2999        643.89
2882     3000       2226.63

[2883 rows x 2 columns]

In [99]:
df_3.query('total_amount>1000').count()

user_id         2544
total_amount    2544
dtype: int64

#### Which restaurant rating range generated the highest total revenue?

In [117]:
# create rating ranges
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]

final_food_delivery_dataset['rating_range'] = pd.cut(
    final_food_delivery_dataset["rating"],
    bins=bins,
    labels=labels,
    include_lowest=True
)
final_food_delivery_dataset

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership,cuisine,rating,rating_range
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Mexican,3.2,3.0–3.5
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Indian,4.5,4.1–4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Mexican,4.0,3.6–4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Chinese,4.8,4.6–5.0
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Italian,3.0,3.0–3.5
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Italian,4.7,4.6–5.0
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Chinese,4.2,4.1–4.5
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Italian,4.0,3.6–4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Italian,4.0,3.6–4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Mexican,3.1,3.0–3.5

In [116]:
final_food_delivery_dataset.groupby('rating_range', observed=True)['total_amount'].sum().round(2).sort_values(ascending=False).reset_index()

  rating_range  total_amount
0      4.6–5.0    2197030.75
1      3.0–3.5    2136772.70
2      4.1–4.5    1960326.26
3      3.6–4.0    1717494.41

#### Among Gold members, which city has the highest average order value?

In [101]:
df_4 = final_food_delivery_dataset.query('membership == "Gold"')[['city', 'total_amount']]
df_4

           city  total_amount
2       Chennai        163.93
3     Bangalore       1155.97
8       Chennai        953.30
11         Pune       1484.65
13      Chennai        898.24
...         ...           ...
9993  Hyderabad        322.54
9994  Bangalore        137.96
9995  Hyderabad       1211.96
9997  Bangalore        979.44
9998  Bangalore       1105.93

[4987 rows x 2 columns]

In [102]:
df_4.groupby('city')['total_amount'].mean().round(2).sort_values(ascending=False)

city
Chennai      808.46
Hyderabad    806.42
Bangalore    793.22
Pune         781.16
Name: total_amount, dtype: float64

#### Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

In [127]:
df_5 = final_food_delivery_dataset.groupby('cuisine')['restaurant_id'].nunique().reset_index()
df_5

   cuisine  restaurant_id
0  Chinese            120
1   Indian            126
2  Italian            126
3  Mexican            128

In [136]:
df_6 = final_food_delivery_dataset.groupby("cuisine")["total_amount"].sum().reset_index()
df_6

   cuisine  total_amount
0  Chinese    1930504.65
1   Indian    1971412.58
2  Italian    2024203.80
3  Mexican    2085503.09

In [137]:
summary = pd.concat([df_5, df_6], axis=1)
summary.sort_values(by='restaurant_id')

   cuisine  restaurant_id  cuisine  total_amount
0  Chinese            120  Chinese    1930504.65
1   Indian            126   Indian    1971412.58
2  Italian            126  Italian    2024203.80
3  Mexican            128  Mexican    2085503.09

#### What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

In [148]:
total_orders = len(final_food_delivery_dataset)
total_orders

10000

In [152]:
gold_orders = final_food_delivery_dataset.query('membership == "Gold"').shape[0]
gold_orders

4987

In [153]:
percentage = round((gold_orders / total_orders) * 100)
percentage

50

#### Which restaurant has the highest average order value but less than 20 total orders?

In [186]:
df_7 = final_food_delivery_dataset.groupby('restaurant_name')['total_amount'].mean().round(2).sort_values(ascending=False).reset_index(name="avg_order_value")
df_7

                restaurant_name  avg_order_value
0       Classic Biryani Chinese          1126.52
1      Hotel Dhaba Multicuisine          1040.22
2              Sri Mess Punjabi          1029.18
3         Ruchi Biryani Punjabi          1002.14
4         Sri Delights Pure Veg           989.47
..                          ...              ...
428   Darbar Restaurant Punjabi           589.97
429       Annapurna Cafe Andhra           589.77
430  Ruchi Tiffins Multicuisine           585.01
431      Spice Tiffins Pure Veg           578.58
432          Ruchi Mess Punjabi           572.69

[433 rows x 2 columns]

In [187]:
df_8 = final_food_delivery_dataset.groupby('restaurant_name')['order_id'].count().sort_values(ascending=False).reset_index(name="total_orders")
df_8

                           restaurant_name  total_orders
0                      Spice Foods Non-Veg            67
1          Darbar Eatery Family Restaurant            63
2                   Sai Restaurant Non-Veg            57
3                Amma Biryani North Indian            57
4                Swagath Cafe Multicuisine            55
..                                     ...           ...
428         New Delights Family Restaurant            11
429  Taste of Restaurant Family Restaurant            10
430              Udupi Restaurant Pure Veg            10
431                 Ruchi Tiffins Pure Veg            10
432                 New Restaurant Chinese             8

[433 rows x 2 columns]

In [188]:
df_9 = pd.merge(df_7, df_8, on='restaurant_name', how='left').query('total_orders<20').sort_values('avg_order_value', ascending=False)
df_9

                       restaurant_name  avg_order_value  total_orders
1             Hotel Dhaba Multicuisine          1040.22            13
2                     Sri Mess Punjabi          1029.18            12
3                Ruchi Biryani Punjabi          1002.14            16
4                Sri Delights Pure Veg           989.47            18
8    Classic Kitchen Family Restaurant           973.17            19
..                                 ...              ...           ...
426          Annapurna Tiffins Punjabi           621.83            19
427             Darbar Tiffins Non-Veg           596.82            18
428          Darbar Restaurant Punjabi           589.97            14
431             Spice Tiffins Pure Veg           578.58            15
432                 Ruchi Mess Punjabi           572.69            17

[170 rows x 3 columns]

## According to my analysis, the restaurant which has the highest average order value but less than 20 total orders is 'Hotel Dhaba Multicuisine' but it's not there in options so I am leaving this question empty in goggle form

#### Which combination contributes the highest revenue?

In [195]:
final_food_delivery_dataset.groupby(['membership', 'cuisine'])['total_amount'].sum().sort_values(ascending=False).reset_index(name='highest_revenue').tail(4)

  membership  cuisine  highest_revenue
4    Regular   Indian        992100.27
5       Gold   Indian        979312.31
6       Gold  Chinese        977713.74
7    Regular  Chinese        952790.91

#### During which quarter of the year is the total revenue highest?

In [198]:
# converting order_date column from object --> datetime data type
final_food_delivery_dataset["order_date"] = pd.to_datetime(
    final_food_delivery_dataset["order_date"],
    dayfirst = True
)

final_food_delivery_dataset["month"] = final_food_delivery_dataset["order_date"].dt.month

In [199]:
bins = [0, 3, 6, 9, 12]
labels = ["Jan–Mar", "Apr–Jun", "Jul–Sep", "Oct–Dec"]

final_food_delivery_dataset["Quarter"] = pd.cut(
    final_food_delivery_dataset["month"],
    bins=bins,
    labels=labels,
    include_lowest=True
)

In [200]:
final_food_delivery_dataset

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership,cuisine,rating,rating_range,month,Quarter
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Mexican,3.2,3.0–3.5,2,Jan–Mar
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Indian,4.5,4.1–4.5,1,Jan–Mar
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Mexican,4.0,3.6–4.0,7,Jul–Sep
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Chinese,4.8,4.6–5.0,10,Oct–Dec
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Italian,3.0,3.0–3.5,12,Oct–Dec
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,2023-05-21,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Italian,4.7,4.6–5.0,5,Apr–Jun
9996,9997,2867,267,2023-08-06,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Chinese,4.2,4.1–4.5,8,Jul–Sep
9997,9998,522,420,2023-11-11,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Italian,4.0,3.6–4.0,11,Oct–Dec
9998,9999,319,492,2023-09-08,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Italian,4.0,3.6–4.0,9,Jul–Sep
9999,10000,457,439,2023-10-21,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Mexican,3.1,3.0–3.5,10,Oct–Dec

In [202]:
final_food_delivery_dataset.groupby('Quarter', observed=False)['total_amount'].sum().sort_values(ascending=False).reset_index()

   Quarter  total_amount
0  Jul–Sep    2037385.10
1  Oct–Dec    2018263.66
2  Jan–Mar    2010626.64
3  Apr–Jun    1945348.72

#### How many total orders were placed by users with Gold membership?

In [203]:
final_food_delivery_dataset.query('membership == "Gold"').shape[0]

4987

#### What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

In [210]:
df_10 = final_food_delivery_dataset.query('city == "Hyderabad"')
print(df_10['total_amount'].sum().round())

1889367.0

#### How many distinct users placed at least one order?

In [213]:
final_food_delivery_dataset['user_id'].nunique()

2883

#### What is the average order value (rounded to 2 decimals) for Gold members?

In [215]:
df_11 = final_food_delivery_dataset.query('membership == "Gold"')
print(df_11['total_amount'].mean().round(2))

797.15

#### How many orders were placed for restaurants with rating ≥ 4.5?

In [220]:
df_12 = final_food_delivery_dataset.query('rating >= 4.5')
print(df_12['order_id'].count())

3374

#### How many orders were placed in the top revenue city among Gold members only?

In [225]:
df_13 = final_food_delivery_dataset.query('membership == "Gold"')
df_14 = df_13.groupby('city')['total_amount'].sum().sort_values(ascending=False).reset_index()
df_14

        city  total_amount
0    Chennai    1080909.79
1       Pune    1003012.32
2  Bangalore     994702.59
3  Hyderabad     896740.19

In [230]:
df_15 = final_food_delivery_dataset.query('(city == "Chennai") and (membership == "Gold")')
print(df_15['order_id'].count())

1337

In [232]:
final_food_delivery_dataset.query('user_id==2508')

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership,cuisine,rating,rating_range,month,Quarter
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Mexican,3.2,3.0–3.5,2,Jan–Mar
7724,7725,2508,99,2023-05-04,207.32,Sri Restaurant Family Restaurant,User_2508,Hyderabad,Regular,Italian,4.0,3.6–4.0,5,Apr–Jun
9323,9324,2508,39,2023-11-10,998.38,Ruchi Delights South Indian,User_2508,Hyderabad,Regular,Indian,4.8,4.6–5.0,11,Oct–Dec